app/controllers/labs_controller.rb

SELECT  "labs".* FROM "labs" WHERE (chart_id ILIKE '%2017%' or cast(received_date as text) ILIKE '%2017%') ORDER BY received_date desc LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "labs"
---
  def index
    @labs = Lab.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 20, :page => params[:page])

SELECT  "labs".* FROM "labs" WHERE "labs"."id" = $1 LIMIT $2  [["id", 350], ["LIMIT", 1]]
---
  def show
    @lab = Lab.find(params[:id])

UPDATE "labs" SET "cholest_SerPI_mCnc" = $1, "source" = $2, "notes" = $3, "reported_date" = $4, "updated_at" = $5 WHERE "labs"."id" = $6  [["cholest_SerPI_mCnc", 12.0], ["source", ""], ["notes", ""], ["reported_date", "2018-05-29"], ["updated_at", "2018-05-29 18:37:27.734012"], ["id", 350]]
---
  def update
    respond_to do |format|
      if @lab.update(lab_params)

INSERT INTO "labs" ("chart_id", "VLDL", "received_date", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["chart_id", "YOJA000001"], ["VLDL", 65.0], ["received_date", "2016-10-17"], ["source", "Lab Corp"], ["created_at", "2018-05-29 18:07:01.857294"], ["updated_at", "2018-05-29 18:07:01.857294"]]
---
  def import_from_excel
    file = params[:file]
    begin
      # Retreive the extension of the file
      file_ext = File.extname(file.original_filename)
      raise "Unknown file type: #{file.original_filename}" unless [".xls", ".xlsx"].include?(file_ext)
      spreadsheet = (file_ext == ".xls") ? Roo::Excel.new(file.path) : Roo::Excelx.new(file.path)
      header = spreadsheet.row(1)
      (2..spreadsheet.last_row).each do |i|
        Lab.create(chart_id: spreadsheet.row(i)[0],
            cholest_SerPI_mCnc: spreadsheet.row(i)[1],
            HDLc_SerPI_mCnc: spreadsheet.row(i)[2],
            Trigl_SerPI_mCnc: spreadsheet.row(i)[3],
            LDLc_SerPI_Calc_mCnc: spreadsheet.row(i)[4],
            Glucose_SerPI_mCnc: spreadsheet.row(i)[5],
            Hgb_A1c_MFr_Bld: spreadsheet.row(i)[6],
            VLDL: spreadsheet.row(i)[7],
            HSCRP: spreadsheet.row(i)[8],
            received_date: spreadsheet.row(i)[9],
            source: spreadsheet.row(i)[10],
            reported_date: spreadsheet.row(i)[11],
            notes: spreadsheet.row(i)[12])

SELECT  "labs".* FROM "labs" WHERE "labs"."id" = $1 LIMIT $2  [["id", 1085], ["LIMIT", 1]]
---
    def set_lab
      @lab = Lab.find(params[:id])